// TODO===========================================ЛОГИЧЕСКИЕ ОПЕРАТОРЫ========================================
// ========================================================================================================
// *     && - И - вовращает в true , если оба значения true
//          если все условия true  -  то возвращает - true
// ========================================================================================================
// const age = 20;
// console.log(age > 18); //true

// //            true       true
// console.log(age > 18 && age < 60); //true

// //            true       false
// console.log(age > 18 && age < 19); //false

// console.log(true && false); //false
// console.log(true && true && false); //false
// ========================================================================================================
// *       || - ИЛИ  - если хотябы одно значение true-то возвращает true
//           если все условия false  -  то возвращает - false
// ========================================================================================================
// console.log(false || true); //true
// console.log(false || true || false); //true

// const age2 = 19;

// //            false      true
// console.log(age2 > 21 || age2 > 18); //true

// const isAdmin = false;
// const someStr = "i am string";
// const result = isAdmin || someStr;

// console.log(result);

// let book = "hello";
// const author = null;
// const title = "";
// //              hello || ""  || "1" || null
// const result2 = title || "1" || author;
// console.log(result2);

// const firstValue = null;
// const secondValue = 5000;

// const resultValue = firstValue || secondValue;

// console.log(resultValue);

// ================================== практика - И
// const a = "hello";
// const b = undefined;
// const c = true;
// //            true && true && true&&false&&null
// const result = a && c && 5 && b && null;
// console.log(result);

// TODO==========================================КОМБИНИРОВАНИЕ && И ||=========================================
// *=====================================================================================
//                                 *ПРИОРИТЕТ БУДЕТ &&
// *=====================================================================================

// console.log(true || (flase && true));

// //                     false   ||   null
// //                            null
// console.log(("hello" && false) || (null && true));

// console.log("" || (30 && "1" && 10 === 10) || false);
//           "" ||   "1"&& true || false
//           "" ||   true ||false
//                  true

// TODO==========================================   ОПЕРАТОРЫ ! (НЕ)      =========================================
// *======================================================================================================
//* СНАЧАЛА ОПЕРАТОР ! (НЕ) ПРИВОДИТ ЗНАЧЕНИЕ К ЛОГИЧЕСКОМУ ТИПУ TRUE/False
// затем возвращает противоположное значение

//            итает с лева на право все операнды

// ----------------------------
// приоритет : 1) ! , 2) &&, 3) ||
// *======================================================================================================

// TODO==========================================   ПРЕОЬРАЗОВАТЕЛИ     =========================================
// =====================================================================================
//                                 *Унарный плюс    +
// =====================================================================================
// let stringNumber = "100";
// console.log(typeof stringNumber);
// console.log(+true); //1
// console.log(+false); //0
// console.log(+null); //0
// console.log(typeof +undefined); //number
// console.log(+undefined);//Nan/ not a number
// console.log(+"h5");
// console.log(+"5h");

// =====================================================================================
//                                 * parseInt
//                            Вытаскивает из строки число
// =====================================================================================

// console.log(typeof parseInt("50")); //number
// console.log(parseInt("50jfkflsflfjsfjekfjek")); //50
// console.log(parseInt("h 50")); //Nan

// // console.log("h50".slice(1));//50   - slice - вырывает  всё с 1
// console.log(parseInt("5.5")); //5  - Int -  показывает целое число , первое число в нецелом

// console.log(parseFloat("1.3")); //1.3     -float -  показывает не целое число(с . )

// let x = true;
// let result2 = x && y;     // ошибка тк переменная у - не обьявлена
// alert(result2);           //строка никогда не появится

// let x = false;
// let result2 = x && y;
// alert(result2);    //false  (значение левого операнда)

// let a = ''
// let b = 7
// let c = 1
// let d = 2

// alert(a||(c&&b)||d )
// //  a|| b || d
// //     d

// let a = 1;
// let b = 7;
// let c = 0;
// let d = 2;

// alert(a || b || c || d);

" " === false;
