// todo=================================================== INCREMENT / DECREMENT =========================================================

// * инкремент - это увеличение переменной на единицу
// -----------------------------------------------------------
// * дикремент - это уменьшение значения переменной на единицу

// let inc = 0;
// inc++;
// inc++;
// inc += 2; //*добавление явного значения
// console.log(inc);

// let dec = 3;
// dec--;
// dec -= 3; //*удаление явного значения
// console.log(dec);
// ---------------------------------------------------------------------------------------------------
//                                             * ПРЕФИКСНЫЙ inc / dec
// ---------------------------------------------------------------------------------------------------

// let i = 5;
// console.log(++i);  //увеличивает на 1 и выведет 6
// console.log(i); //6

// ++i;
// --z;

// console.log(i++); //выведет 5 и только потом выведет 6
// console.log(i); //6

// todo=================================================== ЦИКЛЫ ===================================================

//* ---------------------------------- FOR ----------------------------------------------
//  цикл for - цикл знаете сколько раз нужно что то делать

// for (начало;условие;шаг){
// код для обработки каждого эл-та
// }

// for (let i = 0; i < 5; i++) {
//   console.log(i);
// }

// let students = ["Emir", "Diana", "Aftandil", "Albina"];

// for (let i = 0; i < students.length; i++) {
//   if (students[i] == "Aftandil") {
//     console.log("мы нашли Афтандила");
//   } else {
//     console.log("мы не нашли его");
//   }
// }
// todo================================================== break / continue ==============================================

// ----------------------------------------------------------------------------------------------------
//* break - позволяет преждевременно остоновить цикл , не дожидаясь , пока условие дойдет до false
// ----------------------------------------------------------------------------------------------------
// let arr = [1, 2, 3, 0, 11, 6];
// for (let i = 0; i < arr.length; i++) {
//   console.log("Покажи число", arr[i]);
//   if (arr[i] == 0) break;
// }

// ----------------------------------------------------------------------------------------------------
//*continue - позволяет остановить текущий круг цикла , если continue - срабатывает , то цикл просто переходит на следующий круг , игнорируя остальной код прописанный после слова continue
// ----------------------------------------------------------------------------------------------------
// let arr = ["h", "he", "abc", "salamat", "hello", "a", "goodbye"];
// for (let i = 0; i < arr.length; i++) {
//   if (arr[i].length <= 3) continue;
//   console.log(arr[i]);
// }

// todo================================================== for in / for of ==============================================

// ----------------------------------------------------------------------------------------------------
//* for in - при переборе обьекта , перебирает его ключи( показывает индекс)
// ----------------------------------------------------------------------------------------------------

// let obj = {
//   name: "John",
//   lastname: "Snow",
//   house: "Stark",
//   status: "alive",
// };

// for (let i in obj) {
//   console.log(i, obj[i]);
// }

// for (i of obj) {
//   console.log(i);     //error
// }

// let arr = ["a", "b", "c"];
// for (i in arr) {
//   console.log(i);
//   console.log(arr[i]);
// }

// ----------------------------------------------------------------------------------------------------
//* for... of - позволяет пройтись циклом по значениям (показывает сами значения)
// ----------------------------------------------------------------------------------------------------

// let arr = [1, 2, 3];
// for (i of arr) {
//   console.log(i);
// }
// 2. Дан объект. По ключу нужно выводить значение
// let obj = { model: "AUDI A8", year: "2019", color: "brown" };
// for (i in obj) {
//   console.log(`${i} = ${obj[i]}`);
// }
// пример вывода:
// model = AUDI A8
// year = 2019
// color = brown

// 4. Дан массив с элементами [2, 3, 4, 5]. С помощью цикла for найдите произведение элементов этого массива.
// let arr = [2, 3, 4, 5];
// let sum = 1;
// for (let i = 0; i < arr.length; i++) {
//   sum *= arr[i];
// // sum = sum * arr[i]
// }
// console.log(sum);

//!======= task 2
// let count = 45
// while (count <= 67) {
//     console.log(count);
//     count++;
// }
//!======= task 3
// let arr = ["Paul", "John", "George", "Ringo","Yoko"]
//  for (let i = 0; i < arr.length; i++){
//      console.log(arr[i])
//  }
//!======= task 4
// let arr = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89];
// for (i of arr) {
//   if (i <= 3) {
//     console.log(i);
//   }
// }
//!======= task 5
// let num = 0;
// while (num < 3) {
//   console.log(`number ${num}`);
//   num++;
// }
//!======= task 7

// let arr = [1, 2, 3, 4, 5]
// let sum = 0;
// for (let i = 0; i < arr.length; i++) {
//   sum += arr[i];

// }
// console.log(sum);
//!======= task 9
// const users = { John: 28, Mark: 30, David: 25, Richard: 42 };
// const sum = 0;
// for (in users) {
//   sum = i[1];
//   console.log(sum);
// }
const users = { John: 28, Mark: 30, David: 25, Richard: 42 };

for (i in users) {
  let sum = users[i(1)];
  console.log(sum);
}
